{
  "format": "layers-model",
  "generatedBy": "keras v2.19.0",
  "convertedBy": "TensorFlow.js Converter v4.15.0",
  "modelTopology": {
    "keras_version": "2.19.0",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Sequential",
      "config": {
        "name": "sequential",
        "layers": [
          {
            "class_name": "LSTM",
            "config": {
              "name": "lstm",
              "trainable": true,
              "batch_input_shape": [null, 30, 42],
              "dtype": "float32",
              "return_sequences": true,
              "return_state": false,
              "go_backwards": false,
              "stateful": false,
              "unroll": false,
              "units": 128,
              "activation": "tanh",
              "recurrent_activation": "sigmoid",
              "use_bias": true,
              "dropout": 0.0,
              "recurrent_dropout": 0.0
            }
          },
          {
            "class_name": "Dropout",
            "config": {
              "name": "dropout",
              "trainable": true,
              "dtype": "float32",
              "rate": 0.3,
              "noise_shape": null,
              "seed": null
            }
          },
          {
            "class_name": "LSTM",
            "config": {
              "name": "lstm_1",
              "trainable": true,
              "dtype": "float32",
              "return_sequences": false,
              "return_state": false,
              "go_backwards": false,
              "stateful": false,
              "unroll": false,
              "units": 64,
              "activation": "tanh",
              "recurrent_activation": "sigmoid",
              "use_bias": true,
              "dropout": 0.0,
              "recurrent_dropout": 0.0
            }
          },
          {
            "class_name": "Dropout",
            "config": {
              "name": "dropout_1",
              "trainable": true,
              "dtype": "float32",
              "rate": 0.3,
              "noise_shape": null,
              "seed": null
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense",
              "trainable": true,
              "dtype": "float32",
              "units": 64,
              "activation": "relu",
              "use_bias": true
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_1",
              "trainable": true,
              "dtype": "float32",
              "units": 32,
              "activation": "relu",
              "use_bias": true
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_2",
              "trainable": true,
              "dtype": "float32",
              "units": 2,
              "activation": "softmax",
              "use_bias": true
            }
          }
        ]
      }
    }
  },
  "weightsManifest": [
    {
      "paths": ["model.weights.bin"],
      "weights": [
        {"name": "lstm/lstm_cell/kernel", "shape": [42, 512], "dtype": "float32"},
        {"name": "lstm/lstm_cell/recurrent_kernel", "shape": [128, 512], "dtype": "float32"},
        {"name": "lstm/lstm_cell/bias", "shape": [512], "dtype": "float32"},
        {"name": "lstm_1/lstm_cell_1/kernel", "shape": [128, 256], "dtype": "float32"},
        {"name": "lstm_1/lstm_cell_1/recurrent_kernel", "shape": [64, 256], "dtype": "float32"},
        {"name": "lstm_1/lstm_cell_1/bias", "shape": [256], "dtype": "float32"},
        {"name": "dense/kernel", "shape": [64, 64], "dtype": "float32"},
        {"name": "dense/bias", "shape": [64], "dtype": "float32"},
        {"name": "dense_1/kernel", "shape": [64, 32], "dtype": "float32"},
        {"name": "dense_1/bias", "shape": [32], "dtype": "float32"},
        {"name": "dense_2/kernel", "shape": [32, 2], "dtype": "float32"},
        {"name": "dense_2/bias", "shape": [2], "dtype": "float32"}
      ]
    }
  ]
}